bitbytebitco/EELE465_Final_7DayPillOrg_DS3231_BC417_ST7735/MSP430FR2355.c
#include <msp430.h> 

//
static const unsigned int __attribute__ ((section(".text"))) bitmap[] = {
                               0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xee17, 0xd34c, 0xca67, 0xca47, 0xcac9, 0xdcb1, 0xff7d, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff,
                               0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xff9e, 0xf71c, 0xff9e, 0xffff, 0xffff, 0xffff, 0xf6ba, 0xcac9, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xe4d2, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff,
                               0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xee58, 0xd3ad, 0xcac9, 0xd36c, 0xedf7, 0xffdf, 0xffff, 0xe533, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xd32b, 0xff7d, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff,
                               0xffff, 0xffff, 0xffff, 0xffff, 0xee58, 0xcac9, 0xca27, 0xca27, 0xca27, 0xca68, 0xe595, 0xffff, 0xe4d2, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xcaea, 0xf73c, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff,
                               0xffff, 0xffff, 0xffff, 0xff5d, 0xd36c, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xcaa8, 0xee79, 0xe554, 0xca27, 0xca27, 0xca47, 0xca88, 0xca27, 0xca27, 0xd32b, 0xff9d, 0xffff, 0xff9e, 0xf73c, 0xffbe, 0xffff, 0xffff, 0xffff,
                               0xffff, 0xffff, 0xffff, 0xedf7, 0xca47, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xd38d, 0xedd6, 0xca68, 0xca27, 0xcaa9, 0xd38d, 0xca27, 0xca27, 0xdc2f, 0xffdf, 0xee17, 0xd38c, 0xcac9, 0xd3ad, 0xee79, 0xffff, 0xffff,
                               0xffff, 0xffff, 0xffff, 0xe575, 0xca27, 0xca27, 0xca27, 0xca47, 0xcaea, 0xca88, 0xca27, 0xca47, 0xe4d2, 0xd32b, 0xca27, 0xd32b, 0xdcb1, 0xca27, 0xca27, 0xed95, 0xedd6, 0xca88, 0xca27, 0xca27, 0xca27, 0xcac9, 0xee79, 0xffff,
                               0xffff, 0xffff, 0xffff, 0xf6da, 0xcaa9, 0xca27, 0xca27, 0xca27, 0xcae9, 0xe4d2, 0xd38c, 0xca27, 0xd32b, 0xdc0f, 0xca27, 0xd3cd, 0xe595, 0xca27, 0xd2ea, 0xedb5, 0xcaa9, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xd36c, 0xff5d,
                               0xffff, 0xffff, 0xffff, 0xffff, 0xedd6, 0xcac9, 0xca27, 0xca27, 0xca27, 0xd32b, 0xee38, 0xe533, 0xcae9, 0xdc4f, 0xca88, 0xdc50, 0xee58, 0xca47, 0xdc2f, 0xd38c, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca47, 0xedb6,
                               0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xf6da, 0xdc50, 0xcaa9, 0xca27, 0xca27, 0xd34b, 0xf6fb, 0xf6ba, 0xe574, 0xdc0f, 0xe4f2, 0xf6fb, 0xd32b, 0xdc50, 0xca47, 0xca27, 0xca68, 0xcaea, 0xca47, 0xca27, 0xca27, 0xca27, 0xe533,
                               0xffff, 0xff9e, 0xee58, 0xe595, 0xe554, 0xe595, 0xedd6, 0xe595, 0xdcb1, 0xd3cd, 0xcae9, 0xd3ad, 0xf71c, 0xffff, 0xf6ba, 0xee38, 0xff5d, 0xe4f3, 0xd32b, 0xca27, 0xd36c, 0xe4d2, 0xcaea, 0xca27, 0xca27, 0xca27, 0xcaa9, 0xf699,
                               0xf6db, 0xd3cd, 0xca67, 0xca27, 0xca27, 0xca27, 0xca47, 0xca88, 0xd30a, 0xdbee, 0xedb5, 0xee58, 0xee17, 0xe574, 0xe554, 0xf6da, 0xffff, 0xe574, 0xcac9, 0xe513, 0xee38, 0xd34b, 0xca27, 0xca27, 0xca27, 0xcaa9, 0xedb6, 0xffff,
                               0xdbce, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xcac9, 0xdc2f, 0xedf7, 0xff7d, 0xf73c, 0xd36c, 0xca27, 0xca27, 0xd32b, 0xf6da, 0xe595, 0xf6ba, 0xf6fb, 0xd34b, 0xca27, 0xca27, 0xca88, 0xdc0f, 0xf699, 0xffff, 0xffff,
                               0xcaa9, 0xca27, 0xca27, 0xca27, 0xca47, 0xd34b, 0xdcb1, 0xedf7, 0xee79, 0xee38, 0xee17, 0xe533, 0xca27, 0xca27, 0xca27, 0xca27, 0xe554, 0xffff, 0xf71c, 0xd3ad, 0xcac9, 0xd3cd, 0xe513, 0xf6ba, 0xffdf, 0xffff, 0xffff, 0xffff,
                               0xcae9, 0xca27, 0xca27, 0xca27, 0xca68, 0xd2ea, 0xd2ea, 0xcaa9, 0xca67, 0xcac9, 0xe595, 0xedb6, 0xca27, 0xca27, 0xca27, 0xca27, 0xe595, 0xffdf, 0xee17, 0xdcb1, 0xdcb1, 0xdc91, 0xdc70, 0xdc50, 0xdcb1, 0xedf6, 0xff9d, 0xffff,
                               0xdbee, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xd32b, 0xdc91, 0xf69a, 0xff9d, 0xdc0e, 0xca67, 0xca67, 0xdbee, 0xf71b, 0xe554, 0xd32b, 0xca67, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca47, 0xdbee, 0xff5d,
                               0xee17, 0xca68, 0xca27, 0xca27, 0xca27, 0xca27, 0xca68, 0xdc0f, 0xdc50, 0xd32b, 0xf71b, 0xf699, 0xee79, 0xee79, 0xee17, 0xff7d, 0xffff, 0xff9d, 0xee79, 0xdcb1, 0xd32b, 0xca47, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xe534,
                               0xffdf, 0xe513, 0xcaa9, 0xca67, 0xcac9, 0xdc0f, 0xedd6, 0xdc50, 0xca27, 0xdc0e, 0xf73c, 0xd38c, 0xedf6, 0xffff, 0xf6da, 0xe533, 0xee38, 0xe4f2, 0xe554, 0xedb6, 0xe595, 0xdc90, 0xd30a, 0xca47, 0xca27, 0xca27, 0xca27, 0xdc50,
                               0xffff, 0xffdf, 0xf6fb, 0xee79, 0xf71b, 0xff7d, 0xdc50, 0xca27, 0xca27, 0xe595, 0xe4f2, 0xca47, 0xe4d2, 0xe575, 0xff7d, 0xd34b, 0xd38c, 0xdc2f, 0xca88, 0xca27, 0xca47, 0xca88, 0xca88, 0xca47, 0xca27, 0xca27, 0xca27, 0xe4d2,
                               0xffff, 0xffff, 0xffff, 0xffff, 0xffdf, 0xdcb1, 0xca27, 0xca27, 0xcaea, 0xe574, 0xca88, 0xca67, 0xdcb1, 0xd2ea, 0xf699, 0xe4d2, 0xca27, 0xd34b, 0xe4d2, 0xd32b, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca68, 0xee17,
                               0xffff, 0xffff, 0xffff, 0xffff, 0xee17, 0xca68, 0xca27, 0xca27, 0xd38c, 0xd34c, 0xca27, 0xca88, 0xe513, 0xca67, 0xd3ce, 0xedf7, 0xca68, 0xca27, 0xd32b, 0xedd6, 0xdc70, 0xca68, 0xca27, 0xca27, 0xca27, 0xca27, 0xd3cd, 0xff9e,
                               0xffff, 0xffff, 0xffff, 0xffbe, 0xdbee, 0xca27, 0xca27, 0xca27, 0xcaa9, 0xca47, 0xca27, 0xcac9, 0xedb5, 0xca68, 0xca47, 0xe4d2, 0xd34b, 0xca27, 0xca27, 0xd3ad, 0xf75c, 0xee79, 0xdc50, 0xd32b, 0xcaea, 0xdbee, 0xf6db, 0xffff,
                               0xffff, 0xffff, 0xffff, 0xff7d, 0xd32b, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xd36c, 0xee79, 0xcaa8, 0xca27, 0xcac9, 0xd36c, 0xca27, 0xca27, 0xca27, 0xe533, 0xffff, 0xffdf, 0xff7d, 0xf75c, 0xffbe, 0xffff, 0xffff,
                               0xffff, 0xffff, 0xffff, 0xffbe, 0xd3ce, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xdcb1, 0xf75d, 0xd30a, 0xca27, 0xca27, 0xca68, 0xca27, 0xca27, 0xca27, 0xd34c, 0xff9d, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff,
                               0xffff, 0xffff, 0xffff, 0xffff, 0xf699, 0xd30a, 0xca27, 0xca27, 0xca27, 0xca27, 0xcaa9, 0xf6ba, 0xffdf, 0xd3ce, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xd2ea, 0xf75d, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff,
                               0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xf6fb, 0xdc91, 0xcaea, 0xca88, 0xd2ea, 0xedb5, 0xffff, 0xffff, 0xe574, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xca27, 0xdc50, 0xffdf, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff,
                               0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffdf, 0xf73c, 0xf6ba, 0xf73c, 0xffff, 0xffff, 0xffff, 0xf75c, 0xd36c, 0xca27, 0xca27, 0xca27, 0xca47, 0xdbee, 0xf73c, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff,
                               0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xf6ba, 0xd3ad, 0xcac9, 0xd38c, 0xe595, 0xff9e, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff
                             };

static const unsigned FONT_CHARS[96][5] =
{
  { 0x00, 0x00, 0x00, 0x00, 0x00 }, // (space)
  { 0x00, 0x00, 0x5F, 0x00, 0x00 }, // !
  { 0x00, 0x07, 0x00, 0x07, 0x00 }, // "
  { 0x14, 0x7F, 0x14, 0x7F, 0x14 }, // #
  { 0x24, 0x2A, 0x7F, 0x2A, 0x12 }, // $
  { 0x23, 0x13, 0x08, 0x64, 0x62 }, // %
  { 0x36, 0x49, 0x55, 0x22, 0x50 }, // &
  { 0x00, 0x05, 0x03, 0x00, 0x00 }, // '
  { 0x00, 0x1C, 0x22, 0x41, 0x00 }, // (
  { 0x00, 0x41, 0x22, 0x1C, 0x00 }, // )
  { 0x08, 0x2A, 0x1C, 0x2A, 0x08 }, // *
  { 0x08, 0x08, 0x3E, 0x08, 0x08 }, // +
  { 0x00, 0x50, 0x30, 0x00, 0x00 }, // ,
  { 0x08, 0x08, 0x08, 0x08, 0x08 }, // -
  { 0x00, 0x60, 0x60, 0x00, 0x00 }, // .
  { 0x20, 0x10, 0x08, 0x04, 0x02 }, // /
  { 0x3E, 0x51, 0x49, 0x45, 0x3E }, // 0
  { 0x00, 0x42, 0x7F, 0x40, 0x00 }, // 1
  { 0x42, 0x61, 0x51, 0x49, 0x46 }, // 2
  { 0x21, 0x41, 0x45, 0x4B, 0x31 }, // 3
  { 0x18, 0x14, 0x12, 0x7F, 0x10 }, // 4
  { 0x27, 0x45, 0x45, 0x45, 0x39 }, // 5
  { 0x3C, 0x4A, 0x49, 0x49, 0x30 }, // 6
  { 0x01, 0x71, 0x09, 0x05, 0x03 }, // 7
  { 0x36, 0x49, 0x49, 0x49, 0x36 }, // 8
  { 0x06, 0x49, 0x49, 0x29, 0x1E }, // 9
  { 0x00, 0x36, 0x36, 0x00, 0x00 }, // :
  { 0x00, 0x56, 0x36, 0x00, 0x00 }, // ;
  { 0x00, 0x08, 0x14, 0x22, 0x41 }, // <
  { 0x14, 0x14, 0x14, 0x14, 0x14 }, // =
  { 0x41, 0x22, 0x14, 0x08, 0x00 }, // >
  { 0x02, 0x01, 0x51, 0x09, 0x06 }, // ?
  { 0x32, 0x49, 0x79, 0x41, 0x3E }, // @
  { 0x7E, 0x11, 0x11, 0x11, 0x7E }, // A
  { 0x7F, 0x49, 0x49, 0x49, 0x36 }, // B
  { 0x3E, 0x41, 0x41, 0x41, 0x22 }, // C
  { 0x7F, 0x41, 0x41, 0x22, 0x1C }, // D
  { 0x7F, 0x49, 0x49, 0x49, 0x41 }, // E
  { 0x7F, 0x09, 0x09, 0x01, 0x01 }, // F
  { 0x3E, 0x41, 0x41, 0x51, 0x32 }, // G
  { 0x7F, 0x08, 0x08, 0x08, 0x7F }, // H
  { 0x00, 0x41, 0x7F, 0x41, 0x00 }, // I
  { 0x20, 0x40, 0x41, 0x3F, 0x01 }, // J
  { 0x7F, 0x08, 0x14, 0x22, 0x41 }, // K
  { 0x7F, 0x40, 0x40, 0x40, 0x40 }, // L
  { 0x7F, 0x02, 0x04, 0x02, 0x7F }, // M
  { 0x7F, 0x04, 0x08, 0x10, 0x7F }, // N
  { 0x3E, 0x41, 0x41, 0x41, 0x3E }, // O
  { 0x7F, 0x09, 0x09, 0x09, 0x06 }, // P
  { 0x3E, 0x41, 0x51, 0x21, 0x5E }, // Q
  { 0x7F, 0x09, 0x19, 0x29, 0x46 }, // R
  { 0x46, 0x49, 0x49, 0x49, 0x31 }, // S
  { 0x01, 0x01, 0x7F, 0x01, 0x01 }, // T
  { 0x3F, 0x40, 0x40, 0x40, 0x3F }, // U
  { 0x1F, 0x20, 0x40, 0x20, 0x1F }, // V
  { 0x7F, 0x20, 0x18, 0x20, 0x7F }, // W
  { 0x63, 0x14, 0x08, 0x14, 0x63 }, // X
  { 0x03, 0x04, 0x78, 0x04, 0x03 }, // Y
  { 0x61, 0x51, 0x49, 0x45, 0x43 }, // Z
  { 0x00, 0x00, 0x7F, 0x41, 0x41 }, // [
  { 0x02, 0x04, 0x08, 0x10, 0x20 }, // "\"
  { 0x41, 0x41, 0x7F, 0x00, 0x00 }, // ]
  { 0x04, 0x02, 0x01, 0x02, 0x04 }, // ^
  { 0x40, 0x40, 0x40, 0x40, 0x40 }, // _
  { 0x00, 0x01, 0x02, 0x04, 0x00 }, // `
  { 0x20, 0x54, 0x54, 0x54, 0x78 }, // a
  { 0x7F, 0x48, 0x44, 0x44, 0x38 }, // b
  { 0x38, 0x44, 0x44, 0x44, 0x20 }, // c
  { 0x38, 0x44, 0x44, 0x48, 0x7F }, // d
  { 0x38, 0x54, 0x54, 0x54, 0x18 }, // e
  { 0x08, 0x7E, 0x09, 0x01, 0x02 }, // f
  { 0x08, 0x14, 0x54, 0x54, 0x3C }, // g
  { 0x7F, 0x08, 0x04, 0x04, 0x78 }, // h
  { 0x00, 0x44, 0x7D, 0x40, 0x00 }, // i
  { 0x20, 0x40, 0x44, 0x3D, 0x00 }, // j
  { 0x00, 0x7F, 0x10, 0x28, 0x44 }, // k
  { 0x00, 0x41, 0x7F, 0x40, 0x00 }, // l
  { 0x7C, 0x04, 0x18, 0x04, 0x78 }, // m
  { 0x7C, 0x08, 0x04, 0x04, 0x78 }, // n
  { 0x38, 0x44, 0x44, 0x44, 0x38 }, // o
  { 0x7C, 0x14, 0x14, 0x14, 0x08 }, // p
  { 0x08, 0x14, 0x14, 0x18, 0x7C }, // q
  { 0x7C, 0x08, 0x04, 0x04, 0x08 }, // r
  { 0x48, 0x54, 0x54, 0x54, 0x20 }, // s
  { 0x04, 0x3F, 0x44, 0x40, 0x20 }, // t
  { 0x3C, 0x40, 0x40, 0x20, 0x7C }, // u
  { 0x1C, 0x20, 0x40, 0x20, 0x1C }, // v
  { 0x3C, 0x40, 0x30, 0x40, 0x3C }, // w
  { 0x44, 0x28, 0x10, 0x28, 0x44 }, // x
  { 0x0C, 0x50, 0x50, 0x50, 0x3C }, // y
  { 0x44, 0x64, 0x54, 0x4C, 0x44 }, // z
  { 0x00, 0x08, 0x36, 0x41, 0x00 }, // {
  { 0x00, 0x00, 0x7F, 0x00, 0x00 }, // |
  { 0x00, 0x41, 0x36, 0x08, 0x00 }, // }
  { 0x08, 0x08, 0x2A, 0x1C, 0x08 }, // ->
  { 0x08, 0x1C, 0x2A, 0x08, 0x08 }, // <-
 };


#define TLV_16MHz_ADDR  0x1A2E              // Address of DCO tap trim value for 16MHz
#define TLV_24MHz_ADDR  0x1A30              // Address of DCO tap trim value for 24MHz

#define TARGET_FREQ_16MHZ                   // Define the target frequency of 16MHz
//#define TARGET_FREQ_24MHZ                 // Define the target frequency of 24MHz

#ifdef TARGET_FREQ_16MHZ
#define MCLK_FREQ_MHZ 16                     // MCLK = 16MHz
#endif
#ifdef TARGET_FREQ_24MHZ
#define MCLK_FREQ_MHZ 24                     // MCLK = 24MHz
#endif

