bitbytebitco/EELE465_Final_7DayPillOrg_DS3231_BC417_ST7735/MSP430FR2355.c
// button
volatile int top_button = 0;
volatile int bottom_button = 0;

// SPI related vars
char test[] = {0xAA, 0xBB, 0xCC, 0xDD, 0xEE,0xFF, 0x11, 0x22};
char packet[20];
int Rx_Data;
unsigned int pos;
unsigned int data_len;
volatile int writeCmdFlag = 0;

// RTC
volatile int query_rtc_flag = 0;
char rtc_packet[] = {0x0A, 0x0A, 0x0A, 0x0A, 0x0A, 0x0A, 0x0A};


char rtc_set_packet[] = {0x01, 0x40, 0x12, 0x04, 0x04, 0x05, 0x23}; // [REG_ADDR, minutes, hours, DOW (1-7), DOM (01-31), Month/Century, Year]
int rw = 0; // counter for rtc_set_packet
int mode_b;
int r = 0; // counter for rtc_packet
char str_buf[8]; // buffer for string result

int rtc_count = 0;

// I2C
int b1_i = 0;
char bluetooth_pkt[] = {0x0A, 0x0A, 0x0A, 0x0A, 0x0A, 0x0A, 0x0A, 0xAE};
unsigned int bluetooth_packet_cnt = 0;

// Saved Data
// { sec, min, hours, dow , date, mont/cent , year, bay_num }
char data[31][7] = {{ 0,0,0,0,0,0,0 }};
int week_data[] = {1,1,0,0,0,0,0}; // test week data
int month_data[][7] = {{1,0,0,0,0,0,0},
              {0,0,0,0,0,0,0},
              {0,0,0,0,0,0,0},
              {0,0,0,0,0,0,0}};
int data_i = 0;
int data_j = 0;
int used_today = 0;

int bluetooth_cmd = 0;

// screensaver mode
int screensaver = 1;
int refill_mode = 0;
int refill_cnt = 0;
int display_mode = 0;
volatile int ss_cnt = 0;
volatile int btd_cnt = 0;
volatile int bt_cnt = 0;
volatile int update_bluetooth = 0;

// Cusor
int curX = 0;
int curY = 0;

// TFT constants
#define SWRESET 0x01 // software reset
#define SLPOUT 0x11 // sleep out
#define DISPOFF 0x28 // display off
#define NORON 0x13 //
#define DISPON 0x29 // display on
#define FRMCTR1 0xB1 // framerate control
#define PWCTR1 0xC0 // Power control
#define PWCTR2 0xC1
#define PWCTR3 0xC2
#define GMCTRP1 0xE0
#define GMCTRN1 0xE1

#define CASET 0x2A // column address set
#define RASET 0x2B // row address set
#define RAMWR 0x2C // RAM write
#define MADCTL 0x36 // axis control
#define COLMOD 0x3A // color mode

// 1.8" TFT display constants
#define XSIZE 128
#define YSIZE 160
#define XMAX XSIZE-1
#define YMAX YSIZE-1

// Color constants
#define BLACK 0x0000
#define BLUE 0x001F
#define RED 0xF800
#define GREEN 0x0400
#define LIME 0x07E0
#define CYAN 0x07FF
#define MAGENTA 0xF81F
#define YELLOW 0xFFE0
#define WHITE 0xFFFF

char colors[] = {BLUE, RED, GREEN, LIME, CYAN, MAGENTA, YELLOW, WHITE};

// delay vars
volatile int ms_thresh, ms_count, ms_flag;


unsigned char decToBcd(int dec) {
    return(((dec / 10) * 16) + (dec % 10));
}
unsigned char bcdToDec(int bcd) {
    return(((bcd / 16) * 10) + (bcd % 16));
}

void setClock16Mhz(){
    // Using information gathered from slaa992 and https://www.ti.com/lit/zip/slaa992

    // start clock adjustment
    P2OUT = 0x00;
    P2DIR |= BIT0;                                      // P2.0 for output of start signal

    PM5CTL0 &= ~LOCKLPM5;                               // Disable the GPIO power-on default high-impedance mode
                                                        // to activate previously configured port settings

    // Configure one FRAM wait state as required by the device datasheet for MCLK
    // operation beyond 8MHz _before_ configuring the clock system.
#ifdef TARGET_FREQ_16MHZ
    FRCTL0 = FRCTLPW | NWAITS_1;
#endif
#ifdef TARGET_FREQ_24MHZ
    FRCTL0 = FRCTLPW | NWAITS_2;
#endif

    P2OUT |= BIT0;                                     // Start of the DCO+FLL configuration and FLL lock

    __bis_SR_register(SCG0);                           // disable FLL
    CSCTL3 |= SELREF__REFOCLK;                         // Set REFO as FLL reference source
    CSCTL0 = 0;                                        // clear DCO and MOD registers
#ifdef TARGET_FREQ_16MHZ
    CSCTL1 &= ~(DCORSEL_7);                            // Clear DCO frequency select bits first
    CSCTL1 |= DCORSEL_5;                               // Set DCO frequency range. DCO Range = 16MHz
    CSCTL2 = FLLD_0 + 487;                             // f(DCOCLKDIV) = 16MHz
    CSCTL0 = __data20_read_short(TLV_16MHz_ADDR);      // load DCO TLV trim vale to DCO Tap
#endif
#ifdef TARGET_FREQ_24MHZ
    CSCTL1 &= ~(DCORSEL_7);                            // Clear DCO frequency select bits first
    CSCTL1 |= DCORSEL_7;                               // DCO Range = 16MHz
    CSCTL2 = FLLD_0 + 731;                             // f(DCOCLKDIV) = 24MHz
    CSCTL0 = __data20_read_short(TLV_24MHz_ADDR);      // load DCO TLV trim vale to DCO Tap
#endif
    __delay_cycles(3);
    __bic_SR_register(SCG0);                            // enable FLL

    CSCTL4 |= SELMS__REFOCLK;                           // set REFO(~32768Hz) as MCLK -- This delay may cause fake lock when DCOTAP=0
    __delay_cycles(10);                                 // delay 10 FLL reference clock cycles

    while(CSCTL7 & (FLLUNLOCK0 | FLLUNLOCK1));          // Check if FLL locked

    CSCTL4 = SELMS__DCOCLKDIV | SELA__REFOCLK;          // set default REFO(~32768Hz) as ACLK source, ACLK = 32768Hz
                                                        // default DCOCLKDIV as MCLK and SMCLK source

    P6DIR |= BIT0;                                      // P6.6 as LED blink
    P1DIR |= BIT0 | BIT1;                               // set ACLK, SMCLK and LED pin as output
    P1SEL1 |= BIT0 | BIT1;                              // set P1.0, P1.1 as second function for ACLK, SMCLK output

    // end clock adjustment
}

void initTimerB0compare(){
    // setup TB0
    TB0CTL |= TBCLR;            // Clear TB0
    TB0CTL |= TBSSEL__SMCLK;    // Select SMCLK
    TB0CTL |= MC__UP;           // UP mode

    TB0CCR0 = 1045;             // Set CCR0 value (Period = 1045 for 1ms)
    TB0CCTL0 &= ~CCIFG;         // Clear CCR0 flag
}

/*
 * initTimerB1compare
 *
 * timer for resuming screensaver
 *
 */
void initTimerB1compare() {
    TB1CTL |= TBCLR;            // Clear TB1
    TB1CTL |= TBSSEL__SMCLK;    // Select SMCLK
    TB1CTL |= MC__UP;           // UP mode
    TB1CCR0 = 32768;           // Set CCR0 value (1 ms)  - 1049
    TB1CCTL0 &= ~CCIFG;         // Clear TB1 flag
    TB1CCTL0 |= CCIE;           // Enable TB1 interrupt
}

