bitbytebitco/EELE465_Final_7DayPillOrg_DS3231_BC417_ST7735/MSP430FR2355.c
void initRTC_master(){
     UCB0CTLW0 |= UCSWRST;          // SW RESET ON

     UCB0CTLW0 |= UCSSEL_3;         // SMCLK
     UCB0BRW = 40;                  // Divide 16 Mhz SMCLK by 160 --> 100kHz I2C clock

     UCB0CTLW0 |= UCMODE_3;         // Put into I2C mode
     UCB0CTLW0 |= UCMST;            // Set as MASTER
     UCB0CTLW0 |= UCTR;             // Put into Tx mode
     UCB0I2CSA = 0x0068;            // DS3231 RTC Slave address = 0x68

     UCB0CTLW1 |= 0xC0;             // Set UCCLTO = 11 (~34ms clock low timeout)

     UCB0CTLW1 |= UCASTP_2;         // Enable automatic stop bit
     UCB0TBCNT = sizeof(packet);    // Transfer byte count

     // Setup ports
     P1SEL1 &= ~BIT3;            // P1.3 SCL
     P1SEL0 |= BIT3;

     P1SEL1 &= ~BIT2;            // P1.2 SDA
     P1SEL0 |= BIT2;

     UCB0CTLW0 &= ~UCSWRST;      // SW RESET OFF

     UCB0IE |= UCTXIE0 | UCRXIE0 | UCCLTOIE | UCBCNTIE | UCNACKIE;          // enable I2C B0 Tx, Rx, timeout IRQ

}

void init(){
    WDTCTL = WDTPW | WDTHOLD;   // stop watchdog timer

        // configure eUSCI_A0
        UCA0CTLW0 |= UCSWRST;           // put eUSCI_A0 into RESET mode
        UCA0CTLW0 |= UCSSEL__SMCLK;     // select SMCLK (1MHz)
//        UCA0BRW = 10;                   // divide CLK by 10
        UCA0BRW = 4;

        UCA0CTLW0 |= UCSYNC;            // SPI mode
        UCA0CTLW0 |= UCMST;             // SPI MASTER
        UCA0CTLW0 |= UCMSB;

        UCA0CTLW0 |= UCMODE1;           // 4-wire SPI with STE active LOW
        UCA0CTLW0 &= ~UCMODE0;
        UCA0CTLW0 |= UCSTEM;            // STE pin used for 4-wire SPI

        // Reed Switch
        P3DIR &= ~BIT1;
        P3REN |= BIT1;  // enable P1.1 pull up/down resistors
        P3OUT &= ~BIT1;  // set P1.1 resistor as pull DOWN
        P3IES &= ~BIT1;  // set interrupt mode for rising edge

        P3IE |= (BIT1);   // Local Interrupt enable for P3.1
        P3IFG &= ~(BIT1);     // clear P3.1 IRQ Flag

        P2DIR &= ~(BIT2);                 // enable P2.2-3 as INPUT
        P2REN |= (BIT2);                  // enable resistors
        P2OUT |= (BIT2);                  // pull UP resistor
        P2IES |= (BIT2);                  // H-to-L sensitivity

        P4DIR &= ~BIT0;                       // enable P4.0 as INPUT
        P4REN |= BIT0;                        // enable resistors
        P4OUT |= BIT0;                        // pull UP resistor
        P4IES |= BIT0;                        // H-to-L sensitivity

        P1SEL1 &= ~BIT5;                        // P1.5 SMCLK
        P1SEL0 |= BIT5;

        P1SEL1 &= ~BIT6;                        // P1.6 SOMI
        P1SEL0 |= BIT6;

        P1SEL1 &= ~BIT7;                        // P1.7 SIMO
        P1SEL0 |= BIT7;

        P1SEL1 &= ~BIT4;                        // STE pin setup
        P1SEL0 |= BIT4;

        P1DIR |= BIT0;                  // P1.0 as OUTPUT
        P1OUT &= ~BIT0;                  // P1.0 LOW

        P6DIR |= BIT6;                  // P6.6 as OUTPUT
        P6OUT &= ~BIT6;                 // P6.6 LOW

        P2DIR |= (BIT1 | BIT0);         // P2.0-1 as OUTPUT (2.1 TFT Reset & 2.0 : TFT D/C)
        P2OUT &= ~(BIT1 | BIT0);

        P6DIR |= (BIT0);         // P6.0 as OUTPUT (green LED)
        P6OUT &= ~(BIT0);

        PM5CTL0 &= ~LOCKLPM5;           // turn on I/O

        UCA0CTLW0 &= ~UCSWRST;          // take eUSCI_A0 out of RESET mode

        // Setup IRQs
        P2IE |= BIT2;                   // enable P2.3 IRQ
        P2IFG &= ~BIT2;                 // clear flag

        P4IE |= BIT0;                   // enable P2.3 IRQ
        P4IFG &= ~BIT0;                 // clear flag

        initTimerB0compare();
        initTimerB1compare();

        __enable_interrupt();           // enable global IRQ
}

void setDC(){
    P2OUT |= BIT0;
}
void unsetDC() {
    P2OUT &= ~BIT0;
}

void setTFTreset(){
    P2OUT |= BIT1;
}
void unsetTFTreset(){
    P2OUT &= ~BIT1;
}

void TFTreset(){
    unsetTFTreset();
    delay_ms(1);
    setTFTreset();
    delay_ms(200);
}

void delay_ms(int ms){
    ms_flag = 0;
    ms_count = 0;
    ms_thresh = ms;
    TB0CCTL0 |= CCIE;           // Local IRQ enable for CCR0
    while(ms_flag != 1){}
    TB0CCTL0 &= ~CCIE;          // Disable CCR0
}

void writeByte(int b){

    pos = 0; // set packet index to 0
    data_len = 1; // update length
    UCA0TXBUF = b; // send first byte
    smdel();
//    while((UCA0IFG & UCTXIFG) == 1);
}

void writeCmd(int b){

//    while((UCA0IFG & UCTXIFG) == 1);

    writeCmdFlag = 1;
    pos = 0; // set packet index to 0
    data_len = 1; // update length

    unsetDC();
    UCA0TXBUF = b; // send first byte
    smdel();
    setDC();

//    setDC();
}

void SPI_send(char *bytes, int len){
    int i;
    for(i = 0;i<len; i++){
        packet[i] = *bytes;
        bytes++;
    }

    pos = 0; // set packet index to 0
    data_len = len; // update length
    UCA0TXBUF = packet[pos]; // send first byte
}

void initI2C_master(){
     UCB1CTLW0 |= UCSWRST;          // SW RESET ON

     UCB1CTLW0 |= UCSSEL_3;         // SMCLK
     UCB1BRW = 40;                  // Divide 16 Mhz SMCLK by 40 --> 400kHz I2C clock

     UCB1CTLW0 |= UCMODE_3;         // Put into I2C mode
     UCB1CTLW0 |= UCMST;            // Set as MASTER
     UCB1CTLW0 |= UCTR;             // Put into Tx mode
     UCB1CTLW0 |= UCMSB;

     UCB1CTLW1 |= 0xC0;             // Set UCCLTO = 11 (~34ms clock low timeout)

     UCB1CTLW1 |= UCASTP_2;         // Enable automatic stop bit
     UCB1TBCNT = sizeof(packet);    // Transfer byte count

     // Setup ports
     P4SEL1 &= ~BIT7;            // P4.7 SCL
     P4SEL0 |= BIT7;


     P4SEL1 &= ~BIT6;            // P4.6 SDA
     P4SEL0 |= BIT6;

     PM5CTL0 &= ~LOCKLPM5;       // Turn on I/O
     UCB1CTLW0 &= ~UCSWRST;      // SW RESET OFF

     UCB1IE |= UCTXIE0 | UCRXIE0 | UCCLTOIE | UCBCNTIE | UCNACKIE;                  // Enable I2C TX interrupt

}

void initTFT(){
    TFTreset();
    writeCmd(SLPOUT);
    delay_ms(150);
    writeCmd(COLMOD);
    writeByte(0x05);

    writeCmd(FRMCTR1);
    writeByte(0x0);
    writeByte(0x06);
    writeByte(0x03);
    delay_ms(10);

    writeCmd(PWCTR1);
    writeByte(0x02);
    writeByte(0x70);
    delay_ms(10);

