bitbytebitco/EELE465_Final_7DayPillOrg_DS3231_BC417_ST7735/MSP430FR2355.c
    writeCmd(PWCTR2);
    writeByte(0x05);
    delay_ms(10);

    writeCmd(PWCTR3);
    writeByte(0x01);
    writeByte(0x02);
    delay_ms(10);

    writeCmd(GMCTRP1);
    int i;
    int gm[] = {0x09, 0x16, 0x09, 0x20,       //     (Not entirely necessary, but provides
                0x21, 0x1B, 0x13, 0x19,       //      accurate colors)
                0x17, 0x15, 0x1E, 0x2B,
                0x04, 0x05, 0x02, 0x0E};
    for(i=0;i<sizeof(gm);i++){
        writeByte(gm[i]);
    }
    delay_ms(10);

    writeCmd(GMCTRN1);
    int gm2[] = {0x0B, 0x14, 0x08, 0x1E,       //     (Not entirely necessary, but provides
                0x22, 0x1D, 0x18, 0x1E,       //      accurate colors)
                0x1B, 0x1A, 0x24, 0x2B,
                0x06, 0x06, 0x02, 0x0F};
    for(i=0;i<sizeof(gm2);i++){
        writeByte(gm2[i]);
    }
    delay_ms(10);

    writeCmd(NORON);
    writeCmd(DISPON);
}

void setOrientation(){
    writeCmd(MADCTL);
//    writeByte(0xC0); // 180 deg
    writeByte(0xA0); // 270 deg
}

void WriteWord (int w)
{
    writeByte(w >> 8); // write upper 8 bits
    writeByte(w & 0xFF); // write lower 8 bits
}

void Write565(int data, unsigned int count)
{
    int hb = data >> 8;
    int lb = data;

    for (;count>0;count--)
    {
        writeByte(hb);
        writeByte(lb);
    }
}

void clearWindow(int x1, int y1){
    SetAddrWindow(x1,y1,YMAX,XMAX);
    writeCmd(RAMWR); // memory write
    unsigned int i;
    for (i=40960;i>0;--i) // byte count = 128*160*2
     {
        UCA0TXBUF = 0xFF;
        while((UCA0IFG & UCTXIFG) == 0); // while buffer not empty

     }
}

void clearDisplay(){
    SetAddrWindow(0,0,YMAX,XMAX);
    writeCmd(RAMWR); // memory write
    unsigned int i;
    for (i=40960;i>0;--i) // byte count = 128*160*2
     {
        UCA0TXBUF = 0xFF;
        while((UCA0IFG & UCTXIFG) == 0); // while buffer not empty

     }
}

void drawBitmap(int x0, int y0){
    int w = 28-1;
    SetAddrWindow(x0,y0,x0+w, y0+w);
    writeCmd(RAMWR); // memory write
    unsigned int i;
    int hb,lb;

    for (i=0; i<784; i++){
        hb = bitmap[i] >> 8;
        lb = bitmap[i];
        UCA0TXBUF = hb;
        while((UCA0IFG & UCTXIFG) == 0); // while buffer not empty
        UCA0TXBUF = lb;
        while((UCA0IFG & UCTXIFG) == 0); // while buffer not empty
    }
}

void HLine(int x_0, int x_1, int y, int color){
    int w = x_1-x_0+1;
    SetAddrWindow(x_0,y,x_1,y);
    writeCmd(RAMWR); // memory write
    Write565(color,w);
}

void DrawPixel (int x, int y, int color)
{
    SetAddrWindow(x,y,x,y); // set active region = 1 pixel
    writeCmd(RAMWR); // memory write
    Write565(color,1); // send color for this pixel
}

void smdel(){
    int i,j;
    for(i=0;i<11;i++){
    }
}

void SetAddrWindow(int x_0, int y_0, int x_1, int y_1)
{
 writeCmd(CASET); // set column range (x0,x1)

// x_0
 writeByte(0x0);
 writeByte(x_0);

// x1
 writeByte(0x0);
 writeByte(x_1);

 writeCmd(RASET); // set row range (y0,y1)

// WriteWord(y0);
 writeByte(0x0);
 writeByte(y_0); //y0

// WriteWord(y1);
 writeByte(0x0);
 writeByte(y_1);
}

void fillRect(int x0, int y0, int x1, int y1, int color){
    int w = x1 - x0 + 1;
    int h = y1 - y0 + 1;
    SetAddrWindow(x0, y0, x1, y1);
    writeCmd(RAMWR); // memory write
    Write565(color, w*h);
}

void fillScreen(int back_col){
    SetAddrWindow(0,0,YMAX,XMAX);
    writeCmd(RAMWR); // memory write
    unsigned int i;
    for (i=40960;i>0;--i) // byte count = 128*160*2
     {
        UCA0TXBUF = back_col >> 8;
        while((UCA0IFG & UCTXIFG) == 0); // wait for buffer to empty
        UCA0TXBUF = back_col;
        while((UCA0IFG & UCTXIFG) == 0); // wait for buffer to empty
     }
}

void PutCh (char ch, int x, int y, int color, int bgcolor){
    // write ch to display X,Y coordinates using ASCII 5x7 font

     int pixel;
     int row, col, bit, dataf, mask = 0x01;
     SetAddrWindow(x,y,x+4,y+6);
     writeCmd(RAMWR);

     for (row=0; row<7;row++){
         for (col=0; col<5;col++){
             dataf = FONT_CHARS[ch-32][col];
             bit = dataf & mask;
             if (bit==0) {
                 pixel=bgcolor;
             } else {
                 pixel=color;
             }
             WriteWord(pixel);
         }
         mask <<= 1;
     }
}

void setRTC(){
    UCB0I2CSA = 0x0068;            // DS3231 RTC Slave address = 0x68
    mode_b = 6;
    UCB0CTLW0 |= UCTR;
    UCB0TBCNT = sizeof(rtc_set_packet);
    UCB0CTLW0 |= UCTXSTT;           // Generate START condition
     while((UCB0IFG & UCSTPIFG)==0); // wait for STOP
    UCB0IFG &= ~UCSTPIFG;  // clear the stop flag
}

void queryRTC(){
    UCB0I2CSA = 0x0068;            // DS3231 RTC Slave address = 0x68
    mode_b = 1;
    UCB0CTLW0 |= UCTR;
    UCB0TBCNT = 1;
    UCB0CTLW0 |= UCTXSTT;           // Generate START condition
     while((UCB0IFG & UCSTPIFG)==0); // wait for STOP
    UCB0IFG &= ~UCSTPIFG;  // clear the stop flag

    mode_b = 2;
    UCB0CTLW0 &= ~UCTR;
    UCB0TBCNT = sizeof(rtc_packet);
    UCB0CTLW0 |= UCTXSTT;           // Generate START condition
    while((UCB0IFG & UCSTPIFG)==0); // wait for STOP
    UCB0IFG &= ~UCSTPIFG;  // clear the stop flag
}

int sameDate(char d1[7], char d2[7]){
    if((d1[4] == d2[4]) && (d1[5] == d2[5]) && (d1[6] == d2[6])){
        return 1;
    }
    return 0;
}

int dateExists(char d[7]){
    int j,i;
    int ret = 0;
    if(data_i == 0){
        return 0;
    }
    for(i = 0;i<sizeof(data);i++){
        if(sameDate(data[i], d) == 1){
            ret = i;
        }
    }
    return ret;
}

void fillDataPacket(int i){
    int j;

    if(i == 0){
        for(j = 0;j<sizeof(rtc_packet);j++){
            data[i][j] = rtc_packet[j];
        }
    } else {
//        int date_exists = dateExists(rtc_packet); // TEMP
        int date_exists = 0;
        if(date_exists == 0){
            for(j = 0;j<sizeof(rtc_packet);j++){
                data[i][j] = rtc_packet[j];
            }
        }
    }
}

void fillBluetoothPacket(char pack[]){
    int i;
    for(i=0;i<sizeof(rtc_packet);i++){
        if(i != 7){
            bluetooth_pkt[i] = pack[i];
        }
    }
}

