bitbytebitco/EELE465_Final_7DayPillOrg_DS3231_BC417_ST7735/MSP430FR2355.c
void updateBluetoothController(){
    int i;
    for(i=0;i<data_i;i++){
        fillBluetoothPacket(data[i]);

        UCB1I2CSA = 0x0058;                 // Set slave address
        mode_b = 4;
        b1_i = 0;
        bluetooth_packet_cnt = 0;
        UCB1CTLW0 |= UCTR;
        UCB1TBCNT = sizeof(bluetooth_pkt);
        UCB1CTLW0 |= UCTXSTT;           // Generate START condition
        while((UCB1IFG & UCSTPIFG)==0); // wait for STOP
        UCB0IFG &= ~UCSTPIFG;  // clear the stop flag

        delay_ms(50);
    }
}

void updateMonthUse(){
    int i,j;
    int n = 1;
    for(i=0;i<4;i++){
        for(j=0;j<7;j++){
            if(rtc_packet[4] == n){
                month_data[i][j] = 1;
            }
            n++;
        }
    }
}

void updateTodayUse(){
    // add record (if not in fill mode)
    if(refill_mode == 0){
        used_today = 1;
        week_data[rtc_packet[5]-1] = 1;
        updateMonthUse();
        homeScreen();
        fillDataPacket(data_i);
        data_i++;
    }

}

void display_day(){
    //if(data[0][5] // index 5 has day of week
    if(used_today == 1){
        fillScreen(GREEN);
    } else {
        fillScreen(RED);
    }
}

void display_norecords(){
    clearDisplay();
    setX(2); setY(1);
    writeString("Send Records?");
    setX(1); setY(2);
    writeString("(via Bluetooth)");

    setX(2);
    setY(5);
    writeString("No Records to send.");
}


void set_display_mode(int disp_mode){
    clearDisplay();
    char dow[] = {'S','M','T','W','R','F','Y'};

    if(display_mode == 0){
        display_day();
    } else if(display_mode == 1){
        display_week(week_data, ((XSIZE/2)-(19/2)), dow);
    } else if(display_mode == 2){
        display_month(month_data);
    } else if(display_mode == 3){
        display_bluetooth(7);
    } else if(display_mode == 4){
        display_refill();
    }
}

void setX(int x){
    curX = x;
}
void setY(int y){
    curY = y;
}
void advanceCursor(){
    curX++;
    if(curX > 25){
        curY++;
        curX = 0;
    }
    if(curY > 15){
        curY = 0;
    }
}

void writeString(char *str){
    for(;*str;str++){
        PutCh(*str,curX*6,curY*8,BLACK, WHITE);
        advanceCursor();
    }
}

void display_refill(){
    setX(1);
    setY(1);
    writeString("Refill MODE");
}

void toggle_refill_mode(){
    if(refill_mode == 0){
        refill_mode = 1;
    } else {
        refill_mode = 0;
    }
}

int bitmap_shown = 0;
void update_refill_display(){
//    clearDisplay();
    clearWindow(0, 20);
    display_refill();
    if(bitmap_shown == 0){
        drawBitmap(rand() % 95, (rand() % 50) + 20);
        bitmap_shown = 1;
    } else {
        bitmap_shown = 0;
    }
}

void display_bluetooth(int n){
    int margin = 3;
    int width = 19;
    int k;
    int y = ((XSIZE/2)-(19/2));
    int x = 4;
    int col;

    setX(2);
    setY(1);
    if(update_bluetooth == 0){
        writeString("Send Records?");
        setX(1); setY(2);
        writeString("(via Bluetooth)");

    } else {
        writeString("Sending Records");
        setX(1); setY(2);
        writeString("(via Bluetooth)");
    }

    for(k=0;k<n;k++){
        col = BLUE;
        fillRect(x, y, x+20, y+20, col);
        x = x + width + margin;
    }

}


void display_week(int r[7], int y, char dow[7]){

    int margin = 3;
    int width = 19;
    int k;
//    int x = (XSIZE/2)-(width/2);
    int x = 4;
    int col;

    for(k=0;k<7;k++){
        if(r[k] == 0){
            col = RED;
        } else {
            col = GREEN;
        }
        fillRect(x, y, x+20, y+20, col);
        if(dow[k]<31){
            if(dow[k]<9){
                PutCh(intToAscii((decToBcd(dow[k]) & 0x0F)),x,y,BLACK, col);
            } else {
                PutCh(intToAscii((decToBcd(dow[k]) & 0xF0)>>4),x,y,BLACK, col);
                PutCh(intToAscii((decToBcd(dow[k]) & 0x0F)),x+6,y,BLACK, col);
            }
        } else {
            PutCh(dow[k],x,y,BLACK, col);
        }
        x = x + width + margin;
    }
}

void display_month(int mon[3][7]){
    char dow[4][7] = {{1,2,3,4,5,6,7}, {8,9,10,11,12,13,14}, {15,16,17,18,19,20,21}, {22,23,24,25,26,27,28}};
    int i;
    int y = 20;
    int cnt = 0;
    for(i=0;i<4;i++){

        display_week(mon[i], y, dow[i]);
        y = y+24;
    }
}

int intToAscii(int n){
    int ret;
    if (n > 0) {
        ret =  n + 48;
    } else {
        ret = 0 + 48;
    }
    return ret;
}


void drawClock(int x, int y){
//    int i,j;

//    for(i=0;i<4;i++){

//        for(j=0;j<sizeof(str);j++){
            char *packet = data[0];

            PutCh(intToAscii((packet[5] & 0xF0)>>4),x*6,y*8,BLACK, WHITE); // month (tens)
            x++;
            PutCh(intToAscii((packet[5] & 0x0F)),x*6,y*8,BLACK, WHITE); // month (ones)
            x++;
            PutCh('/',x*6,y*8,BLACK, WHITE);
            x++;


            PutCh(intToAscii((packet[4] & 0xF0)>>4),x*6,y*8,BLACK, WHITE); // day (tens)
            x++;
            PutCh(intToAscii((packet[4] & 0x0F)),x*6,y*8,BLACK, WHITE); // day (ones)
            x++;
            PutCh('/',x*6,y*8,BLACK, WHITE);
            x++;

            PutCh(intToAscii((packet[6] & 0xF0)>>4),x*6,y*8,BLACK, WHITE); // year (tens)
            x++;
            PutCh(intToAscii((packet[6] & 0x0F)),x*6,y*8,BLACK, WHITE); // year (ones)
            x = x+2;


            PutCh(intToAscii((packet[2] & 0xF0)>>4),x*6,y*8,BLACK, WHITE); // hours (tens)
            x++;
            PutCh(intToAscii((packet[2] & 0x0F)),x*6,y*8,BLACK, WHITE); // hours (ones)
            x++;
            PutCh(':',x*6,y*8,BLACK, WHITE);
            x++;

            int t1 = intToAscii((packet[1] & 0b11110000) >> 4);
            PutCh(t1,x*6,y*8,BLACK, WHITE); // minutes (tens)
            x++;
            int t2 = intToAscii((packet[1] & 0x0F));
            PutCh(t2,x*6,y*8,BLACK, WHITE); // minutes (ones)
            x = x+2;

            PutCh(intToAscii((packet[0] & 0xF0)>>4),x*6,y*8,BLACK, WHITE); // seconds (tens)
            x++;
            PutCh(intToAscii((packet[0] & 0x0F)),x*6,y*8,BLACK, WHITE); // seconds (ones)

//        }
//    }
}

void bluetoothSendState(int state){
    if(state == 0){
        bluetooth_pkt[7] = 0x00;
    } else if(state == 1){
        bluetooth_pkt[7] = 0xAE;
    }
    // begin I2C transmission
    updateBluetoothController();
}

void homeScreen(){
    clearDisplay();
    display_mode = 0;
    set_display_mode(0);
    screensaver = 0;
    TB1CTL |= TBCLR; // clear screensaver clock
    ss_cnt = 0;
}

int main(void)
{
    // System inits
    setClock16Mhz();
    init();

    initI2C_master();                   // Intialize master for I2C transmission

    // init & query RTC
    initRTC_master();

    setRTC();

    queryRTC();
    fillDataPacket(0);

    // init TFT
    initTFT();
    setOrientation();
    clearDisplay();

    drawClock(3, 13);

    static const int v = 10;
    static const int t = 0;
    int back_col;


