bitbytebitco/EELE465_Final_7DayPillOrg_DS3231_BC417_ST7735/MSP430FR2355.c
    /*
    // beginning of box
    int w = 160/8;
    HLine(w, 2*w, 50, MAGENTA);
    HLine(3*w, 4*w, 50, MAGENTA);

    HLine(w, 2*w, 50+w, MAGENTA);
    HLine(3*w, 4*w, 50+w, MAGENTA);

    fillRect(0, 0, XSIZE/2, YSIZE/2, LIME);
    */

    char c[] = {BLUE, LIME, GREEN, WHITE};
    int col;

    //homeScreen();

    int i;
    while(1){

        delay_ms(500);
//        SPI_send(test, sizeof(test));
//        delay_ms(5);
        P6OUT ^= BIT0;

        // RTC
        if(rtc_count == 25){
//        if(query_rtc_flag == 1){
            queryRTC(); // query RTC
            fillDataPacket(0); // update current date

            query_rtc_flag = 0;
            rtc_count = 0;
        }
        rtc_count++;

        // TOP BUTTON action

            if(display_mode == 4){
                if(top_button == 1){
                    clearDisplay();
                    display_bluetooth(btd_cnt);

                    // update state
                    if(data_i>0){
                        if(update_bluetooth == 0){
                            update_bluetooth = 1;
                            bluetoothSendState(1); // stop
                        }
//                        else {
//                            update_bluetooth = 0;
//                            bluetoothSendState(1); // start
//                        }
                    } else {
                        display_norecords();
                    }

                    top_button = 0;
                    delay_ms(300);
                    P4IE |= BIT0;        // enable P2.3 IRQ
                    P4IFG &= ~BIT0;      // clear flag
                }
            } else if(display_mode == 5){
                if(top_button == 1){
                    refill_cnt = 0;
                    toggle_refill_mode();

                    top_button = 0;
                    delay_ms(300);
                    P4IE |= BIT0;        // enable P2.3 IRQ
                    P4IFG &= ~BIT0;      // clear flag
                }
            }

            /*
            if(display_mode == 5){

                // set refill mode
                if(refill_mode == 0){
                    refill_mode = 1;
                    screensaver = 0;
                } else {
                    clearDisplay();
                    refill_mode = 0;
                    screensaver = 1;
                }
            }
            */



        // BOTTOM BUTTON action
        if(bottom_button == 1){
            refill_mode = 0; // unset refill mode

            if(update_bluetooth == 1){
                update_bluetooth = 0; // turn off bluetooth animation
                bluetoothSendState(0);
            }


            TB1CTL |= TBCLR; // clear screensaver clock
            ss_cnt = 0;

            screensaver = 0;
            if(display_mode >= 5){
                display_mode = 0;
            }
            set_display_mode(display_mode);
            display_mode++;

            bottom_button = 0;
            delay_ms(300);
            P2IE |= BIT2;        // enable P2.3 IRQ
            P2IFG &= ~BIT2;                 // clear flag
        }

        if(screensaver == 1){
            // random flower bitmaps

            //drawBitmap(rand() % 150,rand() % 50);
            if(rtc_count == 25){
                clearDisplay();
                drawClock(3, 13);
            }

        }


    }

    return 0;
}
// -----------------------------------/
// ISRs ------------------------------/


/*
 * Top Button Interrupt (P2.3)
 */
#pragma vector = PORT4_VECTOR
__interrupt void ISR_PORT2_S4(void){
    top_button = 1;
    screensaver = 0;
    P4IE &= ~BIT0;                   // disable P2.3 IRQ
}

/*
 * Bottom Button Interrupt (P2.2)
 */
#pragma vector = PORT2_VECTOR
__interrupt void ISR_PORT2_S2(void){
    bottom_button = 1;
    P2IE &= ~BIT2;                   // disable P2.2 IRQ
}

/*
 * TIMER (delay_ms)
 */
#pragma vector=TIMER0_B0_VECTOR
__interrupt void ISR_TB0_CCR0(void){
    ms_count++;
    if(ms_count == ms_thresh){
        ms_flag = 1;
        ms_count = 0;
    }

    TB0CCTL0 &= ~CCIFG;
}

#pragma vector = TIMER1_B0_VECTOR
__interrupt void ISR_TB1_CCR0(void) {
    if(update_bluetooth == 1){
        bt_cnt++;
        if(bt_cnt == 150){
            btd_cnt++;
            bt_cnt = 0;
            if(btd_cnt == 8){
                btd_cnt = 0;
                update_bluetooth = 0;
                screensaver = 1;
                display_mode = 0;
            }
            display_bluetooth(btd_cnt);
        }
    } else if(refill_mode == 1){
        refill_cnt++;
        if(refill_cnt == 250){
            refill_cnt = 0;
            update_refill_display();
        }
    } else {
        if(ss_cnt >= 2000){
            ss_cnt = 0;
            screensaver = 1;
        }
        ss_cnt++;
    }


    TB1CCTL0 &= ~CCIFG;     // Clear flag
}



/*
 * I2C (RTC slave)
 */
#pragma vector=EUSCI_B0_VECTOR
__interrupt void EUSCI_B0_TX_ISR(void){
    switch(UCB0IV){
        case 0x16:      // ID 16: RXIFG0
            if(mode_b == 2){
                if (r == (sizeof(rtc_packet)-1)){
                    rtc_packet[r] = UCB0RXBUF;
                    r = 0;
                } else {
                    rtc_packet[r] = UCB0RXBUF;
                    r++;
                }
            }
            break;
        case 0x18:      // ID 18: TXIFG0
            // rtc pointer set
            if(mode_b == 1){
                UCB0TXBUF = 0x00; // set RTC pointer (for reading)
            } else if(mode_b == 5){
                UCB0TXBUF = 0x01; // set RTC pointer to minutes address (for writing)
            } else if(mode_b == 6){
                if (rw == (sizeof(rtc_set_packet)-1)){
                    UCB0TXBUF = rtc_set_packet[rw];
                    rw = 0;
                } else {
                    UCB0TXBUF = rtc_set_packet[rw];
                    rw++;
                }
            }

            break;
        default:
            break;
    }

}


/*
 * Reed Switch
 */
#pragma vector = PORT3_VECTOR
__interrupt void ISR_PORT3_S1(void){
    query_rtc_flag = 1;
    updateTodayUse();
    P3IFG &= ~BIT1;                 // clear flag
}


/*
 * I2C 2310 (slave)
 */
#pragma vector=EUSCI_B1_VECTOR
__interrupt void EUSCI_B1_TX_ISR(void){                     // Fill TX buffer with packet values
    switch(UCB1IV){
        case 0x16:      // ID 16: RXIFG0
//            lm92_packet[j] = UCB1RXBUF;
            break;
        case 0x18:      // ID 18: TXIFG0
            if(mode_b == 3){
                UCB1TXBUF = bluetooth_cmd; // test value
            } else if(mode_b == 4){
                if (b1_i == (sizeof(bluetooth_pkt)-1)){
                    UCB1TXBUF = bluetooth_pkt[b1_i];
                    b1_i = 0;
                } else {
                    UCB1TXBUF = bluetooth_pkt[b1_i];
                    b1_i++;
                }
            }
            break;
        case 0x04: // NACK
            break;
        case 0x1A: // byte count zero interrupt
            break;
        case 0x1C: // clock low timeout
            UCB0CTLW0 |= UCTXNACK;
            break;
        default:
            break;
    }
}
